 در آغاز چون نیاز به توابع کتاب‌خانه‌ی `pandas` دارید، باید آن را `import` کنید.

In [1]:
import pandas as pd

ابتدا فایل
`dates.csv`
که در کنار این نوت‌بوک وجود دارد را به وسیله‌ی کتابخانه
`pandas`
بخوانید

In [2]:
dates = pd.read_csv('dates.csv', sep=",")
dates.head(10)

   Unnamed: 0                               title  year  country        date
0      324126                Synecdoche, New York  2008      USA  2008-11-21
1       66463  Close Encounters of the Third Kind  1977   Greece  1978-03-10
2       51496                      Brotherly Love  1928  Finland  1929-11-18
3      236362                     My Son, My Son!  1940   Mexico  1940-05-23
4      374347         The North Avenue Irregulars  1979      USA  1979-02-09
5      377373                           The Phynx  1970      USA  1970-05-06
6      280556                         Richard III  1912      USA  1912-10-15
7      402546             To Live and Die in L.A.  1985    Spain  1986-05-14
8      350837                             The Fog  2005      USA  2005-10-14
9      145812                           Home (II)  2015   Latvia  2015-03-20

می‌توانید با استفاده از متد
`describe`
خلاصه‌ای از اطلاعات هر ستون را ببینید.

In [3]:
dates.describe()

          Unnamed: 0         year
count    5000.000000  5000.000000
mean   222892.446400  1985.259200
std    126952.536025    27.788351
min       108.000000  1911.000000
25%    113078.500000  1966.000000
50%    222977.500000  1996.000000
75%    332407.000000  2008.000000
max    441544.000000  2020.000000

می‌توانید به وسیله‌ی متد 
`head`
چند ردیف اول از داده را بخوانید

In [8]:
dates.sort_values(by='date').head(5)

      Unnamed: 0              title  year         country        date
2542       10281  A Ticket in Tatts  1911       Australia  1911-06-19
6         280556        Richard III  1912             USA  1912-10-15
1996      405816  Tragedie ve snehu  1913  Czechoslovakia  1913-04-11
430       190944  La terra promessa  1913          France  1913-06-06
2066      259909    Pearl's Mistake  1913             USA  1913-10-14

در`pandas` وقتی  نام ستونی در فایل `csv` ذکر نشده باشد، آن را به صورت `Unnamed: i` نام‌گذاری می‌کند که i نشان‌دهنده‌ی iمین ستون بدون نام است.

اگر به کمک دستور `head` بخشی از داده را مشاهده کرده باشید، می‌بینید که یک ستون `Unnamed` در این داده وجود دارد.

به کمک متد
`drop`
این ستون را حذف کنید.(دقت کنید که برای حذف ستون باید نام کامل آن را در `drop` بنویسید)

In [13]:
dates.drop(columns=['Unnamed: 0'])

                                   title  year      country        date
0                   Synecdoche, New York  2008          USA  2008-11-21
1     Close Encounters of the Third Kind  1977       Greece  1978-03-10
2                         Brotherly Love  1928      Finland  1929-11-18
3                        My Son, My Son!  1940       Mexico  1940-05-23
4            The North Avenue Irregulars  1979          USA  1979-02-09
...                                  ...   ...          ...         ...
4995                                Ymma  2013      Morocco  2013-12-25
4996                              Arnold  1973          USA  1973-11-16
4997           Bob & Carol & Ted & Alice  1969  Netherlands  1970-03-26
4998             The Beverly Hillbillies  1993      Finland  1994-07-15
4999                     Sherlock Holmes  2009       Latvia  2009-12-25

[5000 rows x 4 columns]

۵۰۰ ردیف اول داده را گرفته و در جای دیگری ذخیره کنید.

In [17]:
first_500 = dates.head(500)
first_500

,Unnamed: 0,title,year,country,date
0,324126,"Synecdoche, New York",2008,USA,2008-11-21
1,66463,Close Encounters of the Third Kind,1977,Greece,1978-03-10
2,51496,Brotherly Love,1928,Finland,1929-11-18
3,236362,"My Son, My Son!",1940,Mexico,1940-05-23
4,374347,The North Avenue Irregulars,1979,USA,1979-02-09
...,...,...,...,...,...
495,225090,Mil gritos tiene la noche,1982,Italy,1982-10-08
496,409358,Tumaku Paruni Ta Bhuli,2007,India,2007-12-12
497,430226,Will Success Spoil Rock Hunter?,1957,Finland,1958-01-31
498,390400,The Third Man,1949,Portugal,1950-03-03
499,3171,28 Hotel Rooms,2012,Netherlands,2013-08-01

مجموعه‌ی داده جدید را به وسیله متد 
`to_csv`
در فایل
`sample.csv`
ذخیره کنید.

In [ ]:
first_500.to_csv('sample.csv')

بعد از ذخیره کردن نوت‌بوک، **ارسال پاسخ** را انتخاب کنید.